-- ----------------------------------------------------------------------
-- Test: manage resource group in transaction
-- ----------------------------------------------------------------------
--start_ignore
DROP RESOURCE GROUP rg_test_group;
ERROR:  (42704) resource group "rg_test_group" does not exist
--end_ignore
-- helper view to check the resgroup status
CREATE OR REPLACE VIEW rg_test_monitor AS
    SELECT groupname, concurrency, cpu_rate_limit
    FROM pg_resgroup_config
    WHERE groupname='rg_test_group';
CREATE VIEW
-- ----------------------------------------------------------------------
-- Test: create/alter/drop a resource group in transaction block
-- ----------------------------------------------------------------------
-- CREATE RESOURCE GROUP cannot run inside a transaction block
BEGIN;
BEGIN
    CREATE RESOURCE GROUP rg_test_group WITH cpu_rate_limit 5;
ERROR:  (25001) CREATE RESOURCE GROUP cannot run inside a transaction block
END;
ROLLBACK
SELECT * FROM rg_test_monitor;
 groupname | concurrency | cpu_rate_limit 
-----------+-------------+----------------
(0 rows)

-- ALTER RESOURCE GROUP cannot run inside a transaction block
CREATE RESOURCE GROUP rg_test_group WITH cpu_rate_limit 5;
CREATE RESOURCE GROUP
BEGIN;
BEGIN
    ALTER RESOURCE GROUP rg_test_group SET CONCURRENCY 10;
ERROR:  (25001) ALTER RESOURCE GROUP cannot run inside a transaction block
END;
ROLLBACK
SELECT * FROM rg_test_monitor;
   groupname   | concurrency | cpu_rate_limit 
---------------+-------------+----------------
 rg_test_group | 20          | 5
(1 row)

-- DROP RESOURCE GROUP cannot run inside a transaction block
BEGIN;
BEGIN
    DROP RESOURCE GROUP rg_test_group;
ERROR:  (25001) DROP RESOURCE GROUP cannot run inside a transaction block
END;
ROLLBACK
SELECT * FROM rg_test_monitor;
   groupname   | concurrency | cpu_rate_limit 
---------------+-------------+----------------
 rg_test_group | 20          | 5
(1 row)

DROP RESOURCE GROUP rg_test_group;
DROP RESOURCE GROUP
-- ----------------------------------------------------------------------
-- Test: create/alter/drop a resource group and DML in transaction block
-- ----------------------------------------------------------------------
-- CREATE RESOURCE GROUP cannot run inside a transaction block
BEGIN;
BEGIN
    SELECT 1;
 ?column? 
----------
        1
(1 row)

    CREATE RESOURCE GROUP rg_test_group WITH cpu_rate_limit 5;
ERROR:  (25001) CREATE RESOURCE GROUP cannot run inside a transaction block
END;
ROLLBACK
SELECT * FROM rg_test_monitor;
 groupname | concurrency | cpu_rate_limit 
-----------+-------------+----------------
(0 rows)

-- ALTER RESOURCE GROUP cannot run inside a transaction block
CREATE RESOURCE GROUP rg_test_group WITH cpu_rate_limit 5;
CREATE RESOURCE GROUP
BEGIN;
BEGIN
    SELECT 1;
 ?column? 
----------
        1
(1 row)

    ALTER RESOURCE GROUP rg_test_group SET CONCURRENCY 10;
ERROR:  (25001) ALTER RESOURCE GROUP cannot run inside a transaction block
END;
ROLLBACK
SELECT * FROM rg_test_monitor;
   groupname   | concurrency | cpu_rate_limit 
---------------+-------------+----------------
 rg_test_group | 20          | 5
(1 row)

-- DROP RESOURCE GROUP cannot run inside a transaction block
BEGIN;
BEGIN
    SELECT 1;
 ?column? 
----------
        1
(1 row)

    DROP RESOURCE GROUP rg_test_group;
ERROR:  (25001) DROP RESOURCE GROUP cannot run inside a transaction block
END;
ROLLBACK
SELECT * FROM rg_test_monitor;
   groupname   | concurrency | cpu_rate_limit 
---------------+-------------+----------------
 rg_test_group | 20          | 5
(1 row)

DROP RESOURCE GROUP rg_test_group;
DROP RESOURCE GROUP
-- ----------------------------------------------------------------------
-- Test: create/alter/drop a resource group in subtransaction
-- ----------------------------------------------------------------------
-- CREATE RESOURCE GROUP cannot run inside a subtransaction
BEGIN;
BEGIN
    SAVEPOINT rg_savepoint;
SAVEPOINT
    CREATE RESOURCE GROUP rg_test_group WITH cpu_rate_limit 5;
ERROR:  (25001) CREATE RESOURCE GROUP cannot run inside a transaction block
    ROLLBACK TO SAVEPOINT rg_savepoint;
ROLLBACK
ABORT;
ROLLBACK
SELECT * FROM rg_test_monitor;
 groupname | concurrency | cpu_rate_limit 
-----------+-------------+----------------
(0 rows)

-- ALTER RESOURCE GROUP cannot run inside a subtransaction
CREATE RESOURCE GROUP rg_test_group WITH cpu_rate_limit 5;
CREATE RESOURCE GROUP
BEGIN;
BEGIN
    SAVEPOINT rg_savepoint;
SAVEPOINT
    ALTER RESOURCE GROUP rg_test_group SET CONCURRENCY 10;
ERROR:  (25001) ALTER RESOURCE GROUP cannot run inside a transaction block
    ROLLBACK TO SAVEPOINT rg_savepoint;
ROLLBACK
ABORT;
ROLLBACK
SELECT * FROM rg_test_monitor;
   groupname   | concurrency | cpu_rate_limit 
---------------+-------------+----------------
 rg_test_group | 20          | 5
(1 row)

-- DROP RESOURCE GROUP cannot run inside a subtransaction
BEGIN;
BEGIN
    SAVEPOINT rg_savepoint;
SAVEPOINT
    DROP RESOURCE GROUP rg_test_group;
ERROR:  (25001) DROP RESOURCE GROUP cannot run inside a transaction block
    ROLLBACK TO SAVEPOINT rg_savepoint;
ROLLBACK
ABORT;
ROLLBACK
SELECT * FROM rg_test_monitor;
   groupname   | concurrency | cpu_rate_limit 
---------------+-------------+----------------
 rg_test_group | 20          | 5
(1 row)

DROP RESOURCE GROUP rg_test_group;
DROP RESOURCE GROUP
-- ----------------------------------------------------------------------
-- Test: create/alter/drop a resource group in function call
-- ----------------------------------------------------------------------
CREATE OR REPLACE FUNCTION rg_create_func() RETURNS VOID
AS $$ CREATE RESOURCE GROUP rg_test_group WITH cpu_rate_limit 5 $$
LANGUAGE SQL;
CREATE FUNCTION
CREATE OR REPLACE FUNCTION rg_alter_func() RETURNS VOID
AS $$ ALTER RESOURCE GROUP rg_test_group SET CONCURRENCY 10 $$
LANGUAGE SQL;
CREATE FUNCTION
CREATE OR REPLACE FUNCTION rg_drop_func() RETURNS VOID
AS $$ DROP RESOURCE GROUP rg_test_group $$
LANGUAGE SQL;
CREATE FUNCTION
-- CREATE RESOURCE GROUP cannot run inside a function call
SELECT * FROM rg_create_func();
ERROR:  (25001) CREATE RESOURCE GROUP cannot be executed from a function or multi-command string
CONTEXT:  SQL function "rg_create_func" statement 1
SELECT * FROM rg_test_monitor;
 groupname | concurrency | cpu_rate_limit 
-----------+-------------+----------------
(0 rows)

-- ALTER RESOURCE GROUP cannot run inside a function call
CREATE RESOURCE GROUP rg_test_group WITH cpu_rate_limit 5;
CREATE RESOURCE GROUP
SELECT * FROM rg_alter_func();
ERROR:  (25001) ALTER RESOURCE GROUP cannot be executed from a function or multi-command string
CONTEXT:  SQL function "rg_alter_func" statement 1
SELECT * FROM rg_test_monitor;
   groupname   | concurrency | cpu_rate_limit 
---------------+-------------+----------------
 rg_test_group | 20          | 5
(1 row)

-- DROP RESOURCE GROUP cannot run inside a function call
SELECT * FROM rg_drop_func();
ERROR:  (25001) DROP RESOURCE GROUP cannot be executed from a function or multi-command string
CONTEXT:  SQL function "rg_drop_func" statement 1
SELECT * FROM rg_test_monitor;
   groupname   | concurrency | cpu_rate_limit 
---------------+-------------+----------------
 rg_test_group | 20          | 5
(1 row)

DROP RESOURCE GROUP rg_test_group;
DROP RESOURCE GROUP
DROP FUNCTION rg_create_func();
DROP FUNCTION
DROP FUNCTION rg_alter_func();
DROP FUNCTION
DROP FUNCTION rg_drop_func();
DROP FUNCTION
-- cleanup
DROP VIEW rg_test_monitor;
DROP VIEW
